tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Linter for YAML files
brew "yamllint"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Tool for exploring each layer in a docker image
brew "dive"
# Distributed revision control system
brew "git"
# Open-source GitLab command-line tool
brew "glab"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Send push notifications to your phone or desktop via PUT/POST
brew "ntfy"
# Object-relational database system
brew "postgresql@14", restart_service: true
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Convert HTML to PDF
brew "weasyprint"
# UNIX shell (command interpreter)
brew "zsh"
# Tools for building Android applications
cask "android-studio"
# Chromium based browser
cask "arc"
# Integrated CAD, CAM, CAE, and PCB software
cask "autodesk-fusion360"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Web browser focusing on privacy
cask "brave-browser"
# Free and open-source web browser
cask "chromium"
# API documentation browser and code snippet manager
cask "dash"
# Universal database tool and SQL client
cask "dbeaver-community"
# Full-featured desktop app for DevDocs.io
cask "devdocs"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Emulator for x86 with DOS
cask "dosbox"
# Web browser
cask "firefox"
# Free and open-source media player
cask "iina"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office-businesspro"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk-for-visual-studio"
# Collaboration platform for API development
cask "postman"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Messaging app with a focus on speed and security
cask "telegram"
# Development environment
cask "vagrant"
# Integrated development environment
cask "visual-studio"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# HTML to PDF renderer
cask "wkhtmltopdf"
# Video communication and virtual meeting platform
cask "zoom"
mas "Detail", id: 6443923358
mas "Hand Mirror", id: 1502839586
mas "Irvue", id: 1039633667
mas "JSONPeep", id: 1458969831
mas "Microsoft To Do", id: 1274495053
mas "Spark", id: 1176895641
mas "Speedtest", id: 1153157709
mas "TestFlight", id: 899247664
mas "Tot", id: 1491071483
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "ahmadalli.vscode-nginx-conf"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "AykutSarac.jsoncrack-vscode"
vscode "bbenoist.vagrant"
vscode "bmewburn.vscode-intelephense-client"
vscode "christian-kohler.npm-intellisense"
vscode "cjhowe7.laravel-blade"
vscode "codezombiech.gitignore"
vscode "Compilenix.vscode-zonefile"
vscode "ctcuff.font-preview"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "ecmel.vscode-html-css"
vscode "eiminsasete.apacheconf-snippets"
vscode "EliverLara.mars"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "euskadi31.json-pretty-printer"
vscode "fabianlauer.vs-code-xml-format"
vscode "formulahendry.auto-rename-tag"
vscode "GitLab.gitlab-workflow"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "idered.npm"
vscode "idleberg.applescript"
vscode "jakeboone02.mediawiki"
vscode "James-Yu.latex-workshop"
vscode "jdinhlife.gruvbox"
vscode "jianbingfang.dupchecker"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "maattdd.gitless"
vscode "marp-team.marp-vscode"
vscode "mblode.twig-language-2"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "mikestead.dotenv"
vscode "mkxml.vscode-filesize"
vscode "moppitz.vscode-extension-auto-import"
vscode "mrmlnc.vscode-apache"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nerudevs.jellyfish-dark"
vscode "nidu.copy-json-path"
vscode "pflannery.vscode-versionlens"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "PKief.material-icon-theme"
vscode "redhat.ansible"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rexshi.phpdoc-comment-vscode-plugin"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SimonSiefke.svg-preview"
vscode "snappify.snappify"
vscode "Tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-java-pack"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "WallabyJs.console-ninja"
vscode "wix.vscode-import-cost"
vscode "xdebug.php-pack"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "Zignd.html-css-class-completion"
